cmsis-svd/cmsis-svd/data/Atmel/ATSAML22G18A.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FREQM</name>
      <version>1.0.1</version>
      <description>Frequency Meter</description>
      <groupName>FREQM</groupName>
      <prependToName>FREQM_</prependToName>
      <baseAddress>0x40002C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FREQM</name>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A Register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B Register</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>START</name>
              <description>Start Measurement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGA</name>
          <description>Config A register</description>
          <addressOffset>0x02</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>REFNUM</name>
              <description>Number of Reference Clock Cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear Register</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DONE</name>
              <description>Measurement Done Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set Register</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DONE</name>
              <description>Measurement Done Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Register</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DONE</name>
              <description>Measurement Done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status Register</description>
          <addressOffset>0x0B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>BUSY</name>
              <description>FREQM Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF</name>
              <description>Sticky Count Value Overflow</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE</name>
          <description>Count Value Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Measurement Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GCLK</name>
      <version>1.1.1</version>
      <description>Generic Clock Generator</description>
      <groupName>GCLK</groupName>
      <prependToName>GCLK_</prependToName>
      <baseAddress>0x40001C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset Synchroniation Busy bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GENCTRL0</name>
              <description>Generic Clock Generator Control 0 Synchronization Busy bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL0Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL1</name>
              <description>Generic Clock Generator Control 1 Synchronization Busy bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL1Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL2</name>
              <description>Generic Clock Generator Control 2 Synchronization Busy bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL2Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL3</name>
              <description>Generic Clock Generator Control 3 Synchronization Busy bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL3Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL4</name>
              <description>Generic Clock Generator Control 4 Synchronization Busy bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL4Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GENCTRL%s</name>
          <description>Generic Clock Generator Control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRC</name>
              <description>Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SRCSelect</name>
                <enumeratedValue>
                  <name>XOSC</name>
                  <description>XOSC oscillator output</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLKIN</name>
                  <description>Generator input pad</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLKGEN1</name>
                  <description>Generic clock generator 1 output</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCULP32K</name>
                  <description>OSCULP32K oscillator output</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC32K</name>
                  <description>XOSC32K oscillator output</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC16M</name>
                  <description>OSC16M oscillator output</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFLL48M</name>
                  <description>DFLL48M output</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPLL96M</name>
                  <description>DPLL96M output</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENEN</name>
              <description>Generic Clock Generator Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDC</name>
              <description>Improve Duty Cycle</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OOV</name>
              <description>Output Off Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OE</name>
              <description>Output Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIVSEL</name>
              <description>Divide Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIV</name>
              <description>Division Factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>30</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PCHCTRL%s</name>
          <description>Peripheral Clock Control</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GEN</name>
              <description>Generic Clock Generator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>GENSelect</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHEN</name>
              <description>Channel Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRTLOCK</name>
              <description>Write Lock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
